# NOMOR 2

In [42]:
import mysql.connector
import random

#-----------------------------Connect to the MySQL DATABASE
mydb = mysql.connector.connect(
    host='localhost', 
    user='root',
    password='67_Juli12',
    database='gis_info_complex')
print(mydb)

mycursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001B66474A3D0>

In [43]:
raw_count = 0
#TABLE CITY
for i in range(20, 25):
    city_name = f'C {i+1}'
    #SQL query
    query = "INSERT INTO city (city_name) VALUES (%s)"
    val = [city_name]
    mycursor.execute(query, val)
    raw_count += 1

mydb.commit()
print(raw_count, "record inserted.")

5 record inserted.

In [44]:
raw_count = 0
#TABLE District
for i in range(20, 25):
    for j in range(0, 4):
        district_name = f'C {i+1}, D {j+1}'
        city_ID = i+1
        #SQL query
        query = "INSERT INTO district (district_name, city_ID) VALUES (%s, %s)"
        val = (district_name, city_ID)
        mycursor.execute(query, val)
        raw_count += 1

mydb.commit()
print(raw_count, "record inserted.")

20 record inserted.

In [78]:
raw_count = 0
#TABLE Village
for i in range(0, 20):
    for j in range(0, 5):
        for k in range(0, 5):
            village_name = f'C {i+1}, D {j+1}, V {k+1}'
            district_ID = i*5+j+1
            postal_code = f'PC{i+1}{j+1}{k+1}'
            #SQL query
            query = "INSERT INTO village (village_name, district_ID, postal_code) VALUES (%s, %s, %s)"
            val = (village_name, district_ID, postal_code)
            mycursor.execute(query, val)
            raw_count += 1

mydb.commit()
print(raw_count, "record inserted.")

24 record inserted.

In [79]:
import random

raw_count = 0
#TABLE Thematic
for i in range(2010, 2024):
    for j in range(549, 621):
        value = random.randint(1098, 7564)
        year = i
        category_ID = random.randint(1, 3)
        admin_ID = j
        #SQL query
        query = "INSERT INTO thematic (value, year, category_ID, admin_ID) VALUES (%s, %s, %s, %s)"
        val = (value, year, category_ID, admin_ID)
        mycursor.execute(query, val)
        raw_count += 1

mydb.commit()
print(raw_count, "record inserted.")

1008 record inserted.

In [41]:
#Close the Database Connection
mydb.close()

# NOMOR 3

In [2]:
import mysql.connector
import random

#-----------------------------Connect to the MySQL DATABASE
mydb = mysql.connector.connect(
    host='localhost', 
    user='root',
    password='67_Juli12',
    database='gis_information')
print(mydb)

#-----------------------------Looping for making dumpy data
#initiate all the String Alphabhetic
Alpha = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

#using .cursor() to allow python execute MySQL
mycursor = mydb.cursor()
raw_count = 0
#1st Looping for the Alphabhetic
for i in range(len(Alpha)):
    #2nd Looping for the digit (1-100.000)
    for j in range(1, 10):
        point_name = f'Tower {Alpha[i]}-{j}'
        address = f'Jalan {i*100000+j}'
        Longitude = round(random.uniform(90.4559, 110.7771), 4)
        Latitude = round(random.uniform(-7.9998, 6.7773), 4)
        wkt_geometry = f'POINT({Longitude} {Latitude})'

        #SQL query
        query = "INSERT INTO point (point_name, address, category_id, geom) VALUES (%s, %s, %s, ST_GeomFromText(%s))"
        
        #Every variable that need to be execute
        val = (point_name, address, 43, wkt_geometry)

        #Execute the query command
        mycursor.execute(query, val)
        raw_count += 1


#sends a COMMIT statement to the MySQL server
mydb.commit()
print(raw_count, "record inserted.")

#Close the Database Connection
mydb.close()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001D5A3050250>
90 record inserted.

In [12]:
import pandas as pd
import re

#open the CSV file using pandas
df = pd.read_csv(r"E:\Latihan.csv", sep=';')

#Function for clean the point_name column
def point_name_cleaner(point_name):
    point_name = re.sub(r'[^a-zA-Z0-9]', ' ', point_name)
    point_name = re.sub(r'  ', ' ', point_name)
    point_name = point_name.title()

    return point_name

#Function for clean the address column
def address_cleaner(address):
    address = address.lower()
    address = re.sub(r'jln|jl', 'jalan', address)
    address = re.sub(r'\.', ' ', address)
    address = re.sub(r'  ', ' ', address)
    address = address.title()
    
    return address
    
#Function for clean the phone column
def phone_cleaner(phone):
    phone = re.sub(r'[^0-9]','', phone)
    phone = re.sub(r'^(62)','0', phone)
    return phone

#Call all the function depand on each column needed
df['point_name'] = df.point_name.apply(point_name_cleaner)
df['address'] = df.address.apply(address_cleaner)
df['phone'] = df.phone.apply(phone_cleaner)

#drop any duplicate that appear in the table
df = df.drop_duplicates()

In [13]:
df

                point_name                 address         phone
0          Toko Kue Mahmud        Jalan Prabu No 5   08833452233
1                Sate Ratu      Jalan Pemuda Karya  086219387232
2        Artha Store Shoes           Jalan Pelajar  084762593751
3  Potong Rambut Candimaya       Jalan Malibu Raya     021082761
4              Lucky Store  Jalan Madu Karya Utama    0219387161